X=159
x=X
Y=758
y=Y
res=0
resu=0
while x>0:
    res+= x % 10
    x //=10
while y>0:
    resu += y % 10
    y //= 10
if res == resu:
    print("Сумма цифр числа ", X ," равна cумме цифр числа ", Y )
if res > resu:
    print ("Сумма цифр числа ", X ," больше, чем cумма цифр числа ", Y)
else:
    print ("Сумма цифр числа ", Y ," больше, чем cумма цифр числа ", X)
print ("---------------------------------------------------------------")
print ("Сумма цифр числа ",X, "=", res)
print ("Сумма цифр числа ",Y, "=", resu)